# 3. Написать функцию, аргументы имена сотрудников, возвращает словарь,
# ключи — первые буквы имён, значения — списки, содержащие имена, начинающиеся с соответствующей буквы.
# in
# "Иван", "Мария", "Петр", "Илья", "Марина", "Петр", "Алина", "Бибочка"
# out
#
# {'А': ['Алина'], 'Б': ['Бибочка'], 'И': ['Иван', 'Илья'], 'М': ['Марина', 'Мария'], 'П': ['Петр', 'Петр']}

def _main_(names_str):
    names = [elem.strip().strip('"') for elem in names_str.split(",")]
    dikt = {name[0]: [elem for elem in names if elem[0] == name[0]] for name in names}
    dikt = dict(sorted(dikt.items()))
    return dikt


print(_main_(input()))
